In [1]:
import pandas as pd
from pandas import DataFrame

In [3]:
df = pd.read_csv('/Users/kaiyang/desktop/employeedata.csv')
df.head()

,id,gender,bdate,educ,jobcat,salary,salbegin,jobtime,prevexp,minority
0,1,m,2/3/1952,15,3,57000,27000,98,144,0
1,2,m,5/23/1958,16,1,40200,18750,98,36,0
2,3,f,7/26/1929,12,1,21450,12000,98,381,0
3,4,f,4/15/1947,8,1,21900,13200,98,190,0
4,5,m,2/9/1955,15,1,45000,21000,98,138,0

In [5]:
df.shape

(474, 10)

In [7]:
df.describe()

,id,educ,jobcat,salary,salbegin,jobtime,prevexp,minority
count,474.000000,474.000000,474.000000,474.000000,474.000000,474.000000,474.000000,474.000000
mean,237.500000,13.491561,1.411392,34419.567511,17016.086498,81.109705,95.860759,0.219409
std,136.976275,2.884846,0.773201,17075.661465,7870.638154,10.060945,104.586236,0.414284
min,1.000000,8.000000,1.000000,15750.000000,9000.000000,63.000000,0.000000,0.000000
25%,119.250000,12.000000,1.000000,24000.000000,12487.500000,72.000000,19.250000,0.000000
50%,237.500000,12.000000,1.000000,28875.000000,15000.000000,81.000000,55.000000,0.000000
75%,355.750000,15.000000,1.000000,36937.500000,17490.000000,90.000000,138.750000,0.000000
max,474.000000,21.000000,3.000000,135000.000000,79980.000000,98.000000,476.000000,1.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 474 entries, 0 to 473
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        474 non-null    int64
 1   gender    474 non-null    object
 2   bdate     474 non-null    object
 3   educ      474 non-null    int64
 4   jobcat    474 non-null    int64
 5   salary    474 non-null    int64
 6   salbegin  474 non-null    int64
 7   jobtime   474 non-null    int64
 8   prevexp   474 non-null    int64
 9   minority  474 non-null    int64
dtypes: int64(8), object(2)
memory usage: 37.2+ KB

In [11]:
df['gender'].astype('category') # This does not change the originald dataframe.

0      m
1      m
2      f
3      f
4      m
      ..
469    m
470    m
471    m
472    f
473    f
Name: gender, Length: 474, dtype: category
Categories (2, object): ['f', 'm']

In [13]:
df['gender'] = df['gender'].astype('category')
df['bdate'] = df['bdate'].astype('category')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 474 entries, 0 to 473
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        474 non-null    int64
 1   gender    474 non-null    category
 2   bdate     474 non-null    category
 3   educ      474 non-null    int64
 4   jobcat    474 non-null    int64
 5   salary    474 non-null    int64
 6   salbegin  474 non-null    int64
 7   jobtime   474 non-null    int64
 8   prevexp   474 non-null    int64
 9   minority  474 non-null    int64
dtypes: category(2), int64(8)
memory usage: 51.0 KB

In [17]:
df.describe(include = 'category')

       gender     bdate
count     474       474
unique      2       462
top         m  2/8/1962
freq      258         2

In [19]:
# Laternative appraoch to do this

for col in ['gender', 'bdate']:
    df[col] = df[col].astype('category')
    
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 474 entries, 0 to 473
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        474 non-null    int64
 1   gender    474 non-null    category
 2   bdate     474 non-null    category
 3   educ      474 non-null    int64
 4   jobcat    474 non-null    int64
 5   salary    474 non-null    int64
 6   salbegin  474 non-null    int64
 7   jobtime   474 non-null    int64
 8   prevexp   474 non-null    int64
 9   minority  474 non-null    int64
dtypes: category(2), int64(8)
memory usage: 51.0 KB